---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.ApparentLoad
source: html/765b1432-88ea-e92b-0f3d-7cc261685d6c.htm
---
# Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.ApparentLoad Property

The electrical apparent load of analytical equipment load.

## Syntax (C#)
```csharp
public double ApparentLoad { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The given value for value is not a number
 -or-
 When setting this property: The given value for value is not finite
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for value must be non-negative.